Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.SetMainWeld Method
 Sets the main weld for the logical weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetMainWeld(
	BaseWeld Weld
)
Public Function SetMainWeld (
	Weld As BaseWeld
) As Boolean
Parameters
Weld
Type: Tekla.Structures.Model.BaseWeld
The weld to be set as the main weld.
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace